eis-cart-tests-master@3bc714a7387/tests/test-data/intf-specs/gswf/wsdls/synthetic-requests/BulkSubscriptionPublishingEvent/RaiseEventAsynchron.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://www.thegoldensource.com/EventRaiserService.wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <even:RaiseBulkSubscriptionPublishingEventAsynchron>
         <!--Optional:-->
         <even:Configuration_BLANK_File>?</even:Configuration_BLANK_File>
         <even:Database>?</even:Database>
         <!--Optional:-->
         <even:DateFormat>?</even:DateFormat>
         <!--Optional:-->
         <even:FilePerEntity>?</even:FilePerEntity>
         <!--Optional:-->
         <even:JMSBulkSize>?</even:JMSBulkSize>
         <!--Optional:-->
         <even:No._BLANK_Of_BLANK_Parallel_BLANK_Branches>?</even:No._BLANK_Of_BLANK_Parallel_BLANK_Branches>
         <!--Optional:-->
         <even:PublishingBulkSize>?</even:PublishingBulkSize>
         <!--Optional:-->
         <even:PublishingFileName>?</even:PublishingFileName>
         <!--Optional:-->
         <even:Sample_BLANK_Email_BLANK_Text>?</even:Sample_BLANK_Email_BLANK_Text>
         <!--Optional:-->
         <even:Senders_BLANK_Email>?</even:Senders_BLANK_Email>
         <!--Optional:-->
         <even:StorePublishedMessageToPBDP>?</even:StorePublishedMessageToPBDP>
         <!--Optional:-->
         <even:SubscriptionName>?</even:SubscriptionName>
         <!--Optional:-->
         <even:addCorrelationHeader>?</even:addCorrelationHeader>
         <!--Optional:-->
         <even:addCoveringXMLHeader>?</even:addCoveringXMLHeader>
         <!--Optional:-->
         <even:appendEOFLine>?</even:appendEOFLine>
         <!--Optional:-->
         <even:bulkSize>?</even:bulkSize>
         <!--Optional:-->
         <even:entityMode>?</even:entityMode>
         <!--Optional:-->
         <even:inlineAOIProcessing>?</even:inlineAOIProcessing>
         <!--Optional:-->
         <even:jobId>?</even:jobId>
         <!--Optional:-->
         <even:messageType>?</even:messageType>
         <!--Optional:-->
         <even:modelName>?</even:modelName>
         <even:publishingMode>?</even:publishingMode>
         <!--Optional:-->
         <even:requireFullyQualifiedName>?</even:requireFullyQualifiedName>
         <!--Optional:-->
         <even:sql>?</even:sql>
         <!--Optional:-->
         <even:startRecordSequence>?</even:startRecordSequence>
         <!--Optional:-->
         <even:subscriptionId>?</even:subscriptionId>
         <!--Optional:-->
         <even:transactionId>?</even:transactionId>
      </even:RaiseBulkSubscriptionPublishingEventAsynchron>
   </soapenv:Body>
</soapenv:Envelope>